# IExportContextBase Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
IExportContextBase Members
IExportContextBase Interface Methods See Also
---
The IExportContextBase type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Finish | This method is called at the very end of the export process, after all entities were processed (or after the process was cancelled).  (Inherited from IExportContext.) |
| IsCanceled | This method is queried at the beginning of every element.  (Inherited from IExportContext.) |
| OnCurve | This method is called when a Curve is being output. |
| OnElementBegin | This method marks the beginning of an element to be exported.  (Inherited from IExportContext.) |
| OnElementEnd | This method marks the end of an element being exported.  (Inherited from IExportContext.) |
| OnFaceBegin | This method marks the beginning of a Face to be exported.  (Inherited from IExportContext.) |
| OnFaceEnd | This method marks the end of the current face being exported.  (Inherited from IExportContext.) |
| OnInstanceBegin | This method marks the beginning of a family instance to be exported.  (Inherited from IExportContext.) |
| OnInstanceEnd | This method marks the end of a family instance being exported.  (Inherited from IExportContext.) |
| OnLight | This method marks the beginning of export of a light which is enabled for rendering.  (Inherited from IExportContext.) |
| OnLineSegment | This method is called after unhandled curve was tessellated to line segments and sent to the output. Note for 2D export: if the export is performed for the view in non-Wireframe display style, then |

  * this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D calls
  * this method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline

| OnLinkBegin|  This method marks the beginning of a link instance to be exported.  (Inherited from IExportContext.)
| OnLinkEnd|  This method marks the end of a link instance being exported.  (Inherited from IExportContext.)
| OnMaterial|  This method marks a change of the material.  (Inherited from IExportContext.)
| OnPolyline|  This method is called when a Polyline is being output.
| OnPolylineSegments|  This method is called after unhandled curve was tessellated to polyline segments and sent to the output. Note for 2D export: if the export is performed for the view in non-Wireframe display style, then
  * this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D calls
  * this method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline

| OnPolymesh|  This method is called when a tessellated polymesh of a 3d face is being output.  (Inherited from IExportContext.)
| OnRPC|  This method marks the beginning of export of an RPC object.  (Inherited from IExportContext.)
| OnText|  This method is called when a text annotation object is being output.
| OnViewBegin|  This method marks the beginning of a 3D view to be exported.  (Inherited from IExportContext.)
| OnViewEnd|  This method marks the end of a 3D view being exported.  (Inherited from IExportContext.)
| Start|  This method is called at the very start of the export process, still before the first entity of the model was send out.  (Inherited from IExportContext.)
# See Also
IExportContextBase Interface
Autodesk.Revit.DB Namespace